<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

/*
| -------------------------------------------------------------------
| Common STATUS
| -------------------------------------------------------------------
*/


// アカウントステータス
$config['ACCOUNT_AC_STATUS'] =
array(
		""  => " -- 選択してください -- ",
		"0" => "有効",
		"1" => "無効",
		"9" => "削除",
);


// 顧客ステータス
$config['CUSTOMER_CM_STATUS'] =
array(
		""  => " -- 選択してください -- ",
		"0" => "有効",
		"1" => "一時停止",
		"2" => "解約",
);


// 案件ステータス
$config['PROJECT_PJ_STATUS'] =
array(
		""  => " -- 選択してください -- ",
		"0" => "有効",
		"1" => "一時停止",
		"2" => "解約",
);

// 案件請求書発行ステータス
$config['PROJECT_PJ_INVOICE_STATUS'] =
array(
		""  => " -- 選択してください -- ",
		"0" => "発行",
		"1" => "停止",
);

// 案件請求書発行ステータス
$config['PROJECT_IV_STATUS'] =
array(
		""  => " -- 選択してください -- ",
		"0" => "未　発　行",
		"1" => "発　行　済",
		"9" => "キャンセル",
);







// クライアントステータス
$config['CLIENT_CL_STATUS'] =
array(
		""  => " -- 選択してください -- ",
		"0" => "運用中",
		"1" => "一時停止",
		"8" => "解約",
		"9" => "削除",
);


/* End of file config_status.php */
